CSI API ETABS v1
cSapModel.InitializeNewModel Method
 This function clears the previous model and initializes the program for a new model. If it is later needed, you should save your previous model prior to calling this function.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int InitializeNewModel(
	eUnits Units = eUnits.kip_in_F
)
Function InitializeNewModel (
	Optional Units As eUnits = eUnits.kip_in_F
) As Integer
Dim instance As cSapModel
Dim Units As eUnits
Dim returnValue As Integer
returnValue = instance.InitializeNewModel(Units)
int InitializeNewModel(
	eUnits Units = eUnits::kip_in_F
)
abstract InitializeNewModel :
        ?Units : eUnits
(* Defaults:
        let _Units = defaultArg Units eUnits.kip_in_F
*)
-> int
Parameters
Units (Optional)
Type: ETABSv1.eUnits
 This is the display (present) units for the new model. Possible items in the eUnits enumeration.
 All numerical items are shown in the GUI in display units. All API calls use display units.
 All data stored internally in the model is in database units. If the length unit in the display units is inch or feet, the database units will be set to lb_in_F. Otherwise, the database units are set to N_mm_C.
Return Value
Type: Int32
The function returns zero if a new model is successfully initialized, otherwise it returns a nonzero value.
Remarks
 After calling the InitializeNewModel function, it is not necessary to also call the ApplicationStart function because the functionality of the ApplicationStart function is included in the InitializeNewModel function.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run model (this will create the analysis model)
       ret = SapModel.Analyze.RunAnalysis
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cSapModel Interface
ETABSv1 Namespace